DOC.org
#+TITLE:       Extending Predictions from Spatial Econometric Models on =R=
#+AUTHOR:      Jean-Sauveur Ay
#+LaTeX_CLASS: ManueStat
#+OPTIONS:     LaTeX:t tags:nil toc:nil H:5
#+STARTUP:     hideblocks
#+BIND:        org-latex-image-default-width ""
#+BIND:        org-latex-tables-booktabs t
#+PROPERTY:    session *R*
#+PROPERTY:    exports both
#+PROPERTY:    eval no
#+INFOJS_OPT:  view:t toc:t ltoc:t mouse:underline buttons:0 path:http://thomasf.github.io/solarized-css/org-info.min.js
#+HTML_HEAD:   <link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-light.min.css" />
#+BEGIN_abstract
This repository contains some improvements of the =R= function used to
make predictions from spatial models. The status is actually under
construction: <2014-03-24 lun.>.
#+END_abstract

* Getting started
** TODO Determine output structure
* How it works

\begin{align}
y           & = \rho Wy+X\beta+\gamma WX+ \varepsilon\nonumber\\
\varepsilon & = \lambda W\varepsilon+ u \nonumber
\end{align}

* Function from the package =spdep=

  Our code is an extension of the function =predict.sarlm()= actually
  the default function from the package =spdep= (Bivand).

#+Name: Lst:DFT
#+begin_src R :results output :file "predict-sarlm.R"
library(spdep) ; predict.sarlm
#+end_src

#+RESULTS: Lst:DFT
[[file:predict-sarlm.R]]

* Original material
* Testing
