DOC.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Extending Predictions from Spatial Econometric Models on <code>R</code></title>
<!-- 2014-03-24 lun. 12:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Jean-Sauveur Ay"/>
<link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-light.min.css" />


</head>
<body>
<div id="content">
<h1 class="title">Extending Predictions from Spatial Econometric Models on <code>R</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Getting started</a>
<ul>
<li><a href="#sec-1-1">1.1. Determine output structure</a></li>
</ul>
</li>
<li><a href="#sec-2">2. How it works</a></li>
<li><a href="#sec-3">3. Function from the package <code>spdep</code></a></li>
<li><a href="#sec-4">4. Original material</a></li>
<li><a href="#sec-5">5. Testing</a></li>
</ul>
</div>
</div>
<div class="abstract">
<p>
This repository contains some improvements of the <code>R</code> function used to
make predictions from spatial models. The status is actually under
construction: <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-03-24 lun.&gt;</span></span>.
</p>

</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Getting started</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> Determine output structure</h3>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> How it works</h2>
<div class="outline-text-2" id="text-2">
\begin{align}
y           & = \rho Wy+X\beta+\gamma WX+ \varepsilon\nonumber\\
\varepsilon & = \lambda W\varepsilon+ u \nonumber
\end{align}
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Function from the package <code>spdep</code></h2>
<div class="outline-text-2" id="text-3">
<p>
Our code is an extension of the function <code>predict.sarlm()</code> actually
the default function from the package <code>spdep</code> (Bivand).
</p>

<div class="org-src-container">

<pre class="src src-R" id="Lst:DFT"><span style="color: #4c83ff;">library</span>(spdep) ; predict.sarlm
</pre>
</div>

<p>
<a href="predict-sarlm.R">predict-sarlm.R</a>
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Original material</h2>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Testing</h2>
</div>
</div>
</body>
</html>
